SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( ATSF_GP38_2862
      Type ( Engine )
     	WagonShape ( ATSF_GP38_2862.s )
	Size ( 3.318m 4.768m 17.92m )
	Mass ( 121.1t )
	WheelRadius ( 20in )
	InertiaTensor ( Box (3.22m 4.8m 17.9m) )
	Coupling (
		Type ( Automatic )
		Spring (
			Stiffness ( 1e6N/m 5e7N/m )
			Damping ( 1e7N/m/s 1e8N/m/s )
			Break ( 4e7N 4e7N )
			r0 ( 10cm 10cm )
		)
		Velocity ( 0.1m/s )
	)
	Adheasion ( 0.29 0.51 2 0 )
	DerailRailHeight ( 4cm )
	DerailRailForce ( 2.5*121.1t )
	DerailBufferForce ( 315kN )
	NumWheels ( 8 )
	Friction (
		1287.9N/m/s		-0.10		1.2mph		16.997N/m/s	1.885
		5.1N/rad/s		1		-1rad/s		0		1
	)

	BrakeEquipmentType( "Triple_valve, Auxilary_reservoir, Emergency_brake_reservoir" )
	BrakeSystemType( "Air_single_pipe" )

	MaxBrakeForce( 115.05kN )
	EmergencyBrakeResMaxPressure( 90 )
	TripleValveRatio( 2.5 ) 
	EmergencyResVolumeMultiplier ( 1.461 ) 
	MaxReleaseRate( 0.95 ) 
	MaxApplicationRate( 0.51 ) 
	MaxAuxilaryChargingRate( 0.23 ) 
	EmergencyResCapacity( 2.0631 ) 
	EmergencyResChargingRate( 0.23 ) 
	BrakeCylinderPressureForMaxBrakeBrakeForce( 64 )

	IntakePoint ( -3.33 0.4 FuelDiesel )
	IntakePoint ( 3.33 0.4 FuelDiesel )

	FreightAnim (ATSF_GP38_2862Parts.s 1 1)

	Lights	(	14
		Light	(
			comment( Sphere of light )
			Type		( 1 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( FFFFFFCA )
					Position ( 0.0 4.10 10 )
					Transition ( 0 )
					Radius ( 500.0 )
					Angle ( 42.0 )
					)
				)
			)
		Light (			
                  Comment ( Sphere of lights Dim )
			Type		( 1 )
			Conditions	(
					Headlight ( 2 )
					Unit ( 2 )
					)
			Cycle		( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 40FFFFCA )
					Position ( 0.0 4.0 5.0 )
					Transition ( 0 )
					Radius ( 100.0 )
					Angle ( 45.0 )
					)
				)
			)    
		Light	(
			comment( strobe light front )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			Cycle	( 0 )
			FadeIn	( 0.3 )
			FadeOut	( 0.3 )
			States	(	2
				State	(
					Duration ( 0.075 )
					LightColour ( ffff9900 )
					Position ( 0.0 4.72 6.34 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.41 )
					)
				State	(
					Duration ( 1.0 )
					LightColour ( 00000000 )
					Position ( 0.0 4.72 6.34 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.0 )
					)
				)
			)
		Light	(
			comment( strobe light right )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			Cycle	( 0 )
			FadeIn	( 0.3 )
			FadeOut	( 0.3 )
			States	(	2
				State	(
					Duration ( 0.075 )
					LightColour ( ffff9900 )
					Position ( 0.14 4.72 6.21 )
					Azimuth ( 90 90 90 )
					Transition ( 0 )
					Radius ( 0.41 )
					)
				State	(
					Duration ( 1.0 )
					LightColour ( 00000000 )
					Position ( 0.14 4.72 6.21 )
					Azimuth ( 90 90 90 )
					Transition ( 0 )
					Radius ( 0.0 )
					)
				)
			)
		Light	(
			comment( strobe light back )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			Cycle	( 0 )
			FadeIn	( 0.3 )
			FadeOut	( 0.3 )
			States	(	2
				State	(
					Duration ( 0.075 )
					LightColour ( ffff9900 )
					Position ( 0.0 4.72 6.08 )
					Azimuth ( 180 180 180 )
					Transition ( 0 )
					Radius ( 0.41 )
					)
				State	(
					Duration ( 1.0 )
					LightColour ( 00000000 )
					Position ( 0.0 4.72 6.08 )
					Azimuth ( 180 180 180 )
					Transition ( 0 )
					Radius ( 0.0 )
					)
				)
			)
		Light	(
			comment( strobe light left )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			Cycle	( 0 )
			FadeIn	( 0.3 )
			FadeOut	( 0.3 )
			States	(	2
				State	(
					Duration ( 0.075 )
					LightColour ( ffff9900 )
					Position ( -0.14 4.72 6.21 )
					Azimuth ( -90 -90 -90 )
					Transition ( 0 )
					Radius ( 0.41 )
					)
				State	(
					Duration ( 1.0 )
					LightColour ( 00000000 )
					Position ( -0.14 4.72 6.21 )
					Azimuth ( -90 -90 -90 )
					Transition ( 0 )
					Radius ( 0.0 )
					)
				)
			)
		Light	(
			comment( Bottom Hood light dim )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ffffca )
					Position (  0.0 4.17 6.41 )
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.5 )
					)
				)
			)
		Light	(
			comment( Top Hood light dim )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ffffca )
					Position ( 0.0 4.395 6.43 )
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.5 )
					)
				)
			)
		Light	(
			comment( Hood light Bottom bright )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( FFFFFFCA )
					Position (  0.0 4.17 6.41 )
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.90 )
					)
				)
			)
		Light	(
			comment( Hood light Top bright )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( FFFFFFCA )
					Position ( 0.0 4.395 6.43 )
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.7 )
					)
				)
			)
		Light	(
			comment( Rear right light dim )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 3 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 40FFFFCA )
					Position ( 0.125 3.961 -8.15 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.7 )
					)
				)
			)
		Light	(
			comment( Rear left light dim )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 3 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 40FFFFCA )
					Position ( -0.125 3.961 -8.17 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.5 )
					)
				)
			)
		Light	(
			comment( Rear right light )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 3 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( FFFFFFCA )
					Position ( 0.125 3.961 -8.15 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.7 )
					)
				)
			)
		Light	(
			comment( Rear left light )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 3 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( FFFFFFCA )
					Position ( -0.125 3.961 -8.17 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.7 )
					)
				)
			)
		)
	Sound (	"..\\..\\MC.SND\\MC_EMD645\\645turbo_engSP.sms" )
	
)

Engine ( ATSF_GP38_2862
	Effects
		(
		DieselSpecialEffects
			(

				Exhaust1
				(
					0.1 4.61 .25
					0 1 0
					0.15
				)
                        Exhaust2
				(
					0.1 4.61 -2.1
					0 1 0
					0.15
				)
			)
        	)  
	Wagon ( ATSF_GP38_2862 )
	Type ( Diesel )
	MaxPower ( 1296.3kW ) Comment ( 2000 HP x 87% Eff. )
	MaxForce ( 299.8kN )	
	MaxContinuousForce ( 253.6kN )
	MaxVelocity ( 65mph )
	MaxCurrent ( 1500A ) 
	WheelRadius ( 20in )
	NumWheels ( 4 )
	MaxTemperature ( 120 )
	MaxOilPressure ( 90 )

	CabView ( EMD-SD40-ATSF-YEL-AS.cvf )
	HeadOut ( 1.68 3.39 4.71 )

	AirBrakesAirCompressorPowerRating( 3.5 )
	AirBrakesMainMinResAirPressure( 14.7 )
	AirBrakesMainMaxAirPressure( 140 )
	AirBrakesMainResVolume( 9 )
	AirBrakesAirCompressorWattage( 19000 )
	AirBrakesCompressorRestartPressure( 134 )
	AirBrakesAirUsedPerPoundsOfBrakePipePressure( 1.4 )
	AirBrakesIsCompressorElectricOrMechanical( 1 )
	AirBrakesHasLowPressureTest( 1 )

	EngineBrakesControllerMinPressureReduction( 6 )
	TrainBrakesControllerMinPressureReduction( 6 )
	EngineBrakesControllerHasProportionalBrake( 1 )
	EngineBrakesProportionalBrakeLag( 0.45 )
	EngineBrakesControllerMaxApplicationRate( 7 )
	TrainBrakesControllerMaxApplicationRate( 4 )
	EngineBrakesControllerMaxReleaseRate( 14.5 )
	TrainBrakesControllerMaxReleaseRate( 4.5 )
	EngineBrakesControllerEmergencyApplicationRate( 8 )
	TrainBrakesControllerEmergencyApplicationRate( 7 )
	EngineBrakesControllerMinSystemPressure( 15 )
	TrainBrakesControllerMinSystemPressure( 15 )
	EngineBrakesControllerMaxSystemPressure( 90 )
	TrainBrakesControllerMaxSystemPressure( 90 )
	EngineBrakesControllerEmergencyBrakeTimePenalty( 60 )
	TrainBrakesControllerEmergencyBrakeTimePenalty( 60 )
	EngineBrakesControllerFullServicePressureDrop( 26 )
	TrainBrakesControllerFullServicePressureDrop( 26 )
	EngineBrakesControllerDirectControlExponent( 1 )

	DynamicBrakesMinUsableSpeed( 3 )
	DynamicBrakesMaximumEffectiveSpeed( 23 )
	DynamicBrakesMaximumForce( 177.2kN )
	DynamicBrakesResistorCurrentLimit ( 700 )
	DynamicBrakesCutInSpeed( 6 )
	DynamicBrakesMaxAirBrakePressure ( 50 )
	DynamicBrakesFadingSpeed( 19 )
	DynamicBrakesDelayTimeBeforeEngaging ( 10 )
	DynamicBrakesMaximumSpeedForFadeOut ( 505 )
	DynamicBrakesEffectAtMaximumFadeOut( 0 )
	DynamicBrakesHigherSpeedCurveExponent( 11.2 )
	DynamicBrakesLowerSpeedCurveExponent( 1.3 )
	DynamicBrakesNumberOfControllerNotches( 1 )
      DynamicBrakeHasAutoBailOff ( 1 )
	
      BrakesEngineBrakeType( "Air_single_pipe"  )
	BrakesTrainBrakeType( "Air_single_pipe" )
      BrakesEngineControllers( "Independent, Train, Dynamic" )

	MaxDieselLevel ( 2600gal )
	DieselUsedPerHourAtMaxPower ( 123.2gal )
	DieselUsedPerHourAtIdle ( 4.6gal )
	DieselSmokeEffectInitialMagnitude( 0.2 )
	DieselSmokeEffectMaxMagnitude( 1.2 )
	DieselSmokeEffectInitialSmokeRate( 0.2 )
	DieselSmokeEffectMaxSmokeRate( 2.2 )		
	DieselEngineIdleRPM( 250 )
	DieselEngineMaxRPM( 900 )
	DieselEngineSpeedOfMaxTractiveEffort( 11.4mph )        
      DieselEngineMaxRPMChangeRate( 45 )
	DoesHornTriggerBell( 1 )
 
	EmergencyStopMonitor(
    		MonitoringDeviceMonitorTimeLimit( 0 )
    		MonitoringDeviceAlarmTimeLimit( 0 )
    		MonitoringDevicePenaltyTimeLimit( 0 )
    		MonitoringDeviceCriticalLevel( 0 )
    		MonitoringDeviceResetLevel( 0 )
    		MonitoringDeviceAppliesFullBrake( 0 )
    		MonitoringDeviceAppliesEmergencyBrake( 1 )
    		MonitoringDeviceAppliesCutsPower( 0 )
    		MonitoringDeviceAppliesShutsDownEngine( 0 )
		MonitoringDeviceResetOnZeroSpeed( 0 )
    	) 
      EngineControllers (
            Throttle ( 0 1 0.125 0 
                NumNotches ( 9
                    Notch ( 0       0 Dummy )
                    Notch ( 0.125   0 Dummy )
                    Notch ( 0.25    0 Dummy )
                    Notch ( 0.375   0 Dummy )
                    Notch ( 0.5     0 Dummy )
                    Notch ( 0.625   0 Dummy )
                    Notch ( 0.75    0 Dummy )
                    Notch ( 0.875   0 Dummy )
                    Notch ( 1       0 Dummy )
                )
            )
       	Brake_Engine ( 0 1 0.025 0 
                NumNotches ( 1
                    Notch( 0  1 Dummy )
                )
            )
            Brake_Train ( 0 1 0.0125 0.5 
                NumNotches ( 5
                    Notch( 0    0 TrainBrakesControllerReleaseStart )
                    Notch( 0.3  1 TrainBrakesControllerGraduatedSelfLapLimitedHoldingStart )
                    Notch( 0.85 0 TrainBrakesControllerSuppressionStart )
                    Notch( 0.9  0 TrainBrakesControllerContinuousServiceStart )
                    Notch( 0.95 0 TrainBrakesControllerEmergencyStart )
                )
            )
            Brake_Dynamic ( 0 1 0.11 0 
                NumNotches ( 10 
                	Notch ( 0       0 Dummy )
                    	Notch ( 0.11    0 Dummy )
                  	Notch ( 0.22    0 Dummy )
                   	Notch ( 0.33    0 Dummy )
                   	Notch ( 0.44    0 Dummy )
                   	Notch ( 0.55    0 Dummy )
                   	Notch ( 0.66    0 Dummy )
                   	Notch ( 0.77    0 Dummy )
                   	Notch ( 0.88    0 Dummy )
                   	Notch ( 1       0 Dummy )
                )
            )
            DirControl ( -1 0 1 1 )
            BellToggle( 0 1 0 )
            Sanding ( 0 1 0 )
            Horn ( 0 1 0 )
            EmergencyStopToggle( 0 1 0 )
            Vigilance ( 0 1 0 )
            Headlights ( 0 0.25 1 0 )
            BailOffButton( 0 1 0 )
      )
 	Sound (	"..\\..\\MC.SND\\MC_EMD645\\645turbo_cabSP.sms" )

	Name ("SLI ATSF_GP38_2862")
    	Description (
	"The EMD GP38-2, a popular road unit with a wide range of "+
	"duties from mainline freight to road switching.\n\n"+
	"Locomotive type: EMD GP40-2\n\n"+
	"Power source: Diesel engine 16-645E3\n\n"+
	"Power: 2,000 hp\n\n"+
	"Max. speed: 70 mph (115 km/h)\n\n"+
	"Gear ratio: 62:15\n\n"+
	"Alternator (rectified output): AR10\n\n"+
	"Traction motors: D77\n\n"+
	"Locomotive Class: n/a"+
	"Wheel configuration: Eight 40-in (15.75 cm), tapered tread in B-B configuration (two sets of two "+
	"driven axles)\n\n"+
	"Height: 15 ft. 4 in. (4.7 m)\n\n"+
	"Weight: 133.5 U.S. tons (121.1 metric tons)\n\n"+
	"Length: 59 ft. 2 in. (18 m)\n\n"+
	"Width: 10 ft. 4 in. (3.1 m)"
    	)
)